lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Bluefruit52Lib/src/bluefruit.cpp
#include "bluefruit.h"

#include <stdio.h>
#include <string.h>

#include <nrf54l15_hal.h>

using xiao_nrf54l15::BleConnectionInfo;
using xiao_nrf54l15::BleConnectionEvent;
using xiao_nrf54l15::BleConnectionRole;
using xiao_nrf54l15::BleDisconnectDebug;
using xiao_nrf54l15::BleDisconnectReason;
using xiao_nrf54l15::BleGattCharacteristicProperty;
using xiao_nrf54l15::BleRadio;

constexpr uint8_t kAdTypeFlags = 0x01U;
constexpr uint8_t kAdTypeIncomplete16 = 0x02U;
constexpr uint8_t kAdTypeComplete16 = 0x03U;
constexpr uint8_t kAdTypeIncomplete128 = 0x06U;
constexpr uint8_t kAdTypeComplete128 = 0x07U;
constexpr uint8_t kAdTypeShortName = 0x08U;
constexpr uint8_t kAdTypeCompleteName = 0x09U;
constexpr uint8_t kAdTypeTxPower = 0x0AU;
constexpr uint8_t kAdTypeAppearance = 0x19U;
constexpr uint8_t kAdTypeManufacturer = 0xFFU;
constexpr uint8_t kLedOnState = LOW;
constexpr uint8_t kLedOffState = HIGH;

constexpr uint16_t kUuidDfuService = 0xFE59U;
constexpr uint16_t kCompanyIdApple = 0x004CU;
constexpr uint16_t kUuidPrimaryService = 0x2800U;
constexpr uint16_t kUuidCharacteristic = 0x2803U;
constexpr uint16_t kUuidClientCharacteristicConfig = 0x2902U;

constexpr uint8_t kAttOpErrorRsp = 0x01U;
constexpr uint8_t kAttOpFindInfoReq = 0x04U;
constexpr uint8_t kAttOpFindInfoRsp = 0x05U;
constexpr uint8_t kAttOpFindByTypeValueReq = 0x06U;
constexpr uint8_t kAttOpFindByTypeValueRsp = 0x07U;
constexpr uint8_t kAttOpReadByTypeReq = 0x08U;
constexpr uint8_t kAttOpReadByTypeRsp = 0x09U;
constexpr uint8_t kAttOpReadReq = 0x0AU;
constexpr uint8_t kAttOpReadRsp = 0x0BU;
constexpr uint8_t kAttOpReadByGroupTypeReq = 0x10U;
constexpr uint8_t kAttOpReadByGroupTypeRsp = 0x11U;
constexpr uint8_t kAttOpWriteReq = 0x12U;
constexpr uint8_t kAttOpWriteRsp = 0x13U;
constexpr uint8_t kAttOpHandleValueNtf = 0x1BU;
constexpr uint8_t kAttErrAttributeNotFound = 0x0AU;

static uint8_t normalizeBluefruitPhy(uint8_t phy) {
  switch (phy) {
    case BLE_GAP_PHY_1MBPS:
    case BLE_GAP_PHY_2MBPS:
    case BLE_GAP_PHY_CODED:
      return phy;
    default:
      return BLE_GAP_PHY_AUTO;
  }
}

uint8_t hid_ascii_to_keycode[128][2] = {};
uint8_t hid_keycode_to_ascii[128][2] = {};

void setHidAsciiMapping(char ascii, bool shift, uint8_t keycode) {
  const uint8_t asciiIndex = static_cast<uint8_t>(ascii);
  hid_ascii_to_keycode[asciiIndex][0] = shift ? 1U : 0U;
  hid_ascii_to_keycode[asciiIndex][1] = keycode;

  if (keycode < 128U) {
    hid_keycode_to_ascii[keycode][shift ? 1U : 0U] = asciiIndex;
  }
}

void initHidAsciiTables() {
  static bool initialized = false;
  if (initialized) {
    return;
  }
  initialized = true;

  memset(hid_ascii_to_keycode, 0, sizeof(hid_ascii_to_keycode));
  memset(hid_keycode_to_ascii, 0, sizeof(hid_keycode_to_ascii));

  setHidAsciiMapping('\b', false, HID_KEY_BACKSPACE);
  setHidAsciiMapping('\t', false, HID_KEY_TAB);
  setHidAsciiMapping('\n', false, HID_KEY_ENTER);
  setHidAsciiMapping('\r', false, HID_KEY_ENTER);
  setHidAsciiMapping(0x1BU, false, HID_KEY_ESCAPE);
  setHidAsciiMapping(' ', false, HID_KEY_SPACE);

  for (char ch = 'a'; ch <= 'z'; ++ch) {
    setHidAsciiMapping(ch, false, static_cast<uint8_t>(HID_KEY_A + (ch - 'a')));
  }
  for (char ch = 'A'; ch <= 'Z'; ++ch) {
    setHidAsciiMapping(ch, true, static_cast<uint8_t>(HID_KEY_A + (ch - 'A')));
  }
  for (char ch = '1'; ch <= '9'; ++ch) {
    setHidAsciiMapping(ch, false, static_cast<uint8_t>(HID_KEY_1 + (ch - '1')));
  }
  setHidAsciiMapping('0', false, HID_KEY_0);

  setHidAsciiMapping('!', true, HID_KEY_1);
  setHidAsciiMapping('@', true, HID_KEY_2);
  setHidAsciiMapping('#', true, HID_KEY_3);
  setHidAsciiMapping('$', true, HID_KEY_4);
  setHidAsciiMapping('%', true, HID_KEY_5);
  setHidAsciiMapping('^', true, HID_KEY_6);
  setHidAsciiMapping('&', true, HID_KEY_7);
  setHidAsciiMapping('*', true, HID_KEY_8);
  setHidAsciiMapping('(', true, HID_KEY_9);
  setHidAsciiMapping(')', true, HID_KEY_0);
  setHidAsciiMapping('-', false, HID_KEY_MINUS);
  setHidAsciiMapping('_', true, HID_KEY_MINUS);
  setHidAsciiMapping('=', false, HID_KEY_EQUAL);
  setHidAsciiMapping('+', true, HID_KEY_EQUAL);
  setHidAsciiMapping('[', false, HID_KEY_BRACKET_LEFT);
  setHidAsciiMapping('{', true, HID_KEY_BRACKET_LEFT);
  setHidAsciiMapping(']', false, HID_KEY_BRACKET_RIGHT);
  setHidAsciiMapping('}', true, HID_KEY_BRACKET_RIGHT);
  setHidAsciiMapping('\\', false, HID_KEY_BACKSLASH);
  setHidAsciiMapping('|', true, HID_KEY_BACKSLASH);
  setHidAsciiMapping(';', false, HID_KEY_SEMICOLON);
  setHidAsciiMapping(':', true, HID_KEY_SEMICOLON);
  setHidAsciiMapping('\'', false, HID_KEY_APOSTROPHE);
  setHidAsciiMapping('"', true, HID_KEY_APOSTROPHE);
  setHidAsciiMapping('`', false, HID_KEY_GRAVE);
  setHidAsciiMapping('~', true, HID_KEY_GRAVE);
  setHidAsciiMapping(',', false, HID_KEY_COMMA);
  setHidAsciiMapping('<', true, HID_KEY_COMMA);
  setHidAsciiMapping('.', false, HID_KEY_PERIOD);
  setHidAsciiMapping('>', true, HID_KEY_PERIOD);
  setHidAsciiMapping('/', false, HID_KEY_SLASH);
  setHidAsciiMapping('?', true, HID_KEY_SLASH);

  hid_keycode_to_ascii[HID_KEY_KEYPAD_DIVIDE][0] = '/';
  hid_keycode_to_ascii[HID_KEY_KEYPAD_DIVIDE][1] = '/';
  hid_keycode_to_ascii[HID_KEY_KEYPAD_MULTIPLY][0] = '*';
  hid_keycode_to_ascii[HID_KEY_KEYPAD_MULTIPLY][1] = '*';
  hid_keycode_to_ascii[HID_KEY_KEYPAD_SUBTRACT][0] = '-';
  hid_keycode_to_ascii[HID_KEY_KEYPAD_SUBTRACT][1] = '-';
  hid_keycode_to_ascii[HID_KEY_KEYPAD_ADD][0] = '+';
  hid_keycode_to_ascii[HID_KEY_KEYPAD_ADD][1] = '+';
  hid_keycode_to_ascii[HID_KEY_KEYPAD_ENTER][0] = '\r';
  hid_keycode_to_ascii[HID_KEY_KEYPAD_ENTER][1] = '\r';
  hid_keycode_to_ascii[HID_KEY_KEYPAD_1][0] = '1';
  hid_keycode_to_ascii[HID_KEY_KEYPAD_2][0] = '2';
  hid_keycode_to_ascii[HID_KEY_KEYPAD_3][0] = '3';
  hid_keycode_to_ascii[HID_KEY_KEYPAD_4][0] = '4';
  hid_keycode_to_ascii[HID_KEY_KEYPAD_5][0] = '5';
  hid_keycode_to_ascii[HID_KEY_KEYPAD_5][1] = '5';
  hid_keycode_to_ascii[HID_KEY_KEYPAD_6][0] = '6';
  hid_keycode_to_ascii[HID_KEY_KEYPAD_7][0] = '7';
  hid_keycode_to_ascii[HID_KEY_KEYPAD_8][0] = '8';
  hid_keycode_to_ascii[HID_KEY_KEYPAD_9][0] = '9';
  hid_keycode_to_ascii[HID_KEY_KEYPAD_0][0] = '0';
  hid_keycode_to_ascii[HID_KEY_KEYPAD_DECIMAL][0] = '.';
}

struct HidAsciiTableInit {
  HidAsciiTableInit() { initHidAsciiTables(); }
} g_hid_ascii_table_init;

