lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Bluefruit52Lib/src/bluefruit.cpp
  BLEConnection* connection() { return &connection_; }

  bool startRssiMonitor(uint8_t threshold) {
    if (!radio_.isConnected()) {
      return false;
    }
    rssi_monitor_enabled_ = true;
    rssi_monitor_threshold_ = threshold;
    last_reported_rssi_valid_ = radio_.getLatestConnectionRssiDbm(&last_reported_rssi_dbm_);
    return true;
  }

  int8_t currentConnectionRssi() const {
    int8_t rssiDbm = 0;
    if (!radio_.getLatestConnectionRssiDbm(&rssiDbm)) {
      return 0;
    }
    return rssiDbm;
  }

  bool queueCentralConnect(const ble_gap_evt_adv_report_t* report) {
    if (report == nullptr) {
      return false;
    }
    memcpy(pending_connect_address_, report->peer_addr.addr, sizeof(pending_connect_address_));
    pending_connect_random_ =
        (report->peer_addr.addr_type == BLE_GAP_ADDR_TYPE_RANDOM_STATIC) ? 1U : 0U;
    pending_connect_valid_ = true;
    Bluefruit.Scanner.paused_ = true;
    return maybeConnectCentral();
  }

  void handleCentralConnectionEvent(const BleConnectionEvent& event) {
    if (!(event.packetReceived && event.crcOk && event.attPacket && event.payload != nullptr &&
          event.payloadLength >= 7U)) {
      return;
    }
    const uint8_t attOpcode = event.payload[4];
    if (attOpcode != kAttOpHandleValueNtf) {
      return;
    }

    const uint16_t valueHandle = readLe16(&event.payload[5]);
    const uint16_t valueLength =
        (event.payloadLength >= 7U) ? static_cast<uint16_t>(event.payloadLength - 7U) : 0U;
    const uint8_t* value = &event.payload[7];
    for (uint8_t i = 0U; i < client_characteristic_count_; ++i) {
      BLEClientCharacteristic* characteristic = client_characteristics_[i];
      if (characteristic == nullptr || !characteristic->discovered_) {
        continue;
      }
      if (characteristic->value_handle_ == valueHandle) {
        characteristic->handleNotify(value, valueLength);
        return;
      }
    }
  }

  void idleService() {
    if (!started_) {
      return;
    }

    if (!radio_.isConnected()) {
      maybeAdvertise();
      maybeScanOrConnect();
    }

    const bool connected = radio_.isConnected();
    if (connected != last_connected_) {
      handleConnectionEdge(connected);
      last_connected_ = connected;
    }

    if (connected) {
      maybeApplyDeferredConnectionRequests();
      maybeDispatchRssiUpdate();
      if (radio_.connectionRole() == BleConnectionRole::kPeripheral) {
        for (uint8_t i = 0U; i < characteristic_count_; ++i) {
          if (characteristics_[i] != nullptr) {
            characteristics_[i]->pollCccdState();
          }
        }
      } else if (radio_.connectionRole() == BleConnectionRole::kCentral) {
        processCentralBackgroundEvents(4U);
      }
    }
  }

  uint32_t idleSleepCapUs() const {
    if (!started_) {
      return 0U;
    }

    if (centralSyncProcedureActive() || pending_connect_valid_) {
      return 1U;
    }
    if (Bluefruit.Scanner.running_ && !Bluefruit.Scanner.paused_ &&
        Bluefruit.Scanner.rx_callback_ != nullptr) {
      return 1U;
    }
    if (Bluefruit.Advertising.running_) {
      return 1U;
    }
    if (radio_.isConnected()) {
      if ((millis() - last_connection_edge_ms_) < kBleNoWfiDuringSetupMs) {
        return 1U;
      }
      return kBleActiveIdleSleepCapUs;
    }
    return 0U;
  }

 private:
  static constexpr uint8_t kMaxCharacteristics = 24U;
  static constexpr uint8_t kMaxClientCharacteristics = 16U;
  static constexpr uint16_t kDefaultDataLength = 27U;
  static constexpr uint16_t kDefaultAttMtu = 23U;
  static constexpr uint16_t kDeferredDataLengthTarget =
      static_cast<uint16_t>(BleRadio::kCustomGattMaxValueLength + 7U);
  static constexpr unsigned long kDeferredLinkRequestInitialDelayMs = 250UL;
  static constexpr unsigned long kDeferredLinkRequestRetryMs = 500UL;
  static constexpr uint8_t kDeferredLinkRequestMaxAttempts = 20U;

  BleRadio radio_;
  bool started_;
  bool last_connected_;
  BleConnectionRole last_connection_role_;
  unsigned long last_connection_edge_ms_;
  uint32_t next_adv_due_us_;
  unsigned long adv_started_ms_;
  bool scan_rsp_name_added_;
  BLECharacteristic* characteristics_[kMaxCharacteristics];
  uint8_t characteristic_count_;
  BLEClientCharacteristic* client_characteristics_[kMaxClientCharacteristics];
  uint8_t client_characteristic_count_;
  BLEConnection connection_;
  ble_gap_evt_adv_report_t scan_report_;
  uint8_t scan_report_data_[31];
  uint8_t scan_report_len_;
  bool pending_connect_valid_;
  uint8_t pending_connect_address_[6];
  uint8_t pending_connect_random_;
  uint8_t central_sync_procedure_depth_;
  bool central_data_length_request_pending_;
  bool central_mtu_request_pending_;
  bool deferred_connection_phy_request_pending_;
  bool deferred_connection_data_length_request_pending_;
  bool deferred_connection_mtu_request_pending_;
  uint8_t deferred_connection_requested_phy_;
  uint16_t deferred_connection_requested_mtu_;
  unsigned long deferred_connection_phy_next_ms_;
  unsigned long deferred_connection_data_length_next_ms_;
  unsigned long deferred_connection_mtu_next_ms_;
  uint8_t deferred_connection_phy_attempts_;
  uint8_t deferred_connection_data_length_attempts_;
  uint8_t deferred_connection_mtu_attempts_;
  unsigned long central_link_config_not_before_ms_;
  unsigned long last_connect_attempt_ms_;
  bool rssi_monitor_enabled_;
  uint8_t rssi_monitor_threshold_;
  int8_t last_reported_rssi_dbm_;
  bool last_reported_rssi_valid_;

  static void gattWriteThunk(uint16_t valueHandle, const uint8_t* value,
                             uint8_t valueLength, bool withResponse, void* context) {
    (void)withResponse;
    auto* self = static_cast<BluefruitCompatManager*>(context);
    if (self != nullptr) {
      self->handleGattWrite(valueHandle, value, valueLength);
    }
  }

  void handleGattWrite(uint16_t valueHandle, const uint8_t* value, uint8_t valueLength) {
    for (uint8_t i = 0U; i < characteristic_count_; ++i) {
      BLECharacteristic* characteristic = characteristics_[i];
      if (characteristic == nullptr) {
        continue;
      }
      if (characteristic->_handles.value_handle == valueHandle) {
        characteristic->handleWriteFromRadio(value, valueLength);
        return;
      }
    }
  }

  static void fillReportType(uint8_t pduHeader, ble_gap_adv_report_type_t* outType) {
    if (outType == nullptr) {
      return;
    }
    memset(outType, 0, sizeof(*outType));
    switch (pduHeader & 0x0FU) {
      case 0x00U:
        outType->connectable = 1U;
        outType->scannable = 1U;
        break;
      case 0x01U:
        outType->connectable = 1U;
        outType->directed = 1U;
        break;
      case 0x02U:
        break;
      case 0x04U:
        outType->scan_response = 1U;
        break;
      case 0x06U:
        outType->scannable = 1U;
        break;
      default:
        break;
    }
  }

  bool buildScanReport(const xiao_nrf54l15::BleScanPacket& packet) {
    if (packet.payload == nullptr || packet.length < 6U) {
      return false;
    }
    memset(&scan_report_, 0, sizeof(scan_report_));
    memcpy(scan_report_.peer_addr.addr, packet.payload, 6U);
    scan_report_.peer_addr.addr_type =
        ((packet.pduHeader >> 6U) & 0x1U) ? BLE_GAP_ADDR_TYPE_RANDOM_STATIC
                                          : BLE_GAP_ADDR_TYPE_PUBLIC;
    scan_report_.rssi = packet.rssiDbm;
    fillReportType(packet.pduHeader, &scan_report_.type);

