lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Bluefruit52Lib/src/bluefruit.cpp
    scan_report_len_ = static_cast<uint8_t>(packet.length - 6U);
    if (scan_report_len_ > sizeof(scan_report_data_)) {
      scan_report_len_ = sizeof(scan_report_data_);
    }
    if (scan_report_len_ > 0U) {
      memcpy(scan_report_data_, &packet.payload[6], scan_report_len_);
    }
    scan_report_.data.p_data = scan_report_data_;
    scan_report_.data.len = scan_report_len_;
    return true;
  }

  bool buildScanReport(const xiao_nrf54l15::BleActiveScanResult& result) {
    return buildScanReport(result, false);
  }

  bool buildScanReport(const xiao_nrf54l15::BleActiveScanResult& result,
                       bool scanResponse) {
    const uint8_t* payload = nullptr;
    uint8_t payloadLength = 0U;
    uint8_t pduHeader = 0U;
    int8_t rssiDbm = -127;

    if (scanResponse) {
      if (!result.scanResponseReceived || result.scanRspPayloadLength < 6U) {
        return false;
      }
      payload = result.scanRspPayload;
      payloadLength = result.scanRspPayloadLength;
      pduHeader = result.scanRspHeader;
      rssiDbm = result.scanRspRssiDbm;
    } else {
      if (result.advPayloadLength < 6U) {
        return false;
      }
      payload = result.advPayload;
      payloadLength = result.advPayloadLength;
      pduHeader = result.advHeader;
      rssiDbm = result.advRssiDbm;
    }

    memset(&scan_report_, 0, sizeof(scan_report_));
    memcpy(scan_report_.peer_addr.addr, payload, 6U);
    scan_report_.peer_addr.addr_type =
        ((pduHeader >> 6U) & 0x1U) ? BLE_GAP_ADDR_TYPE_RANDOM_STATIC
                                   : BLE_GAP_ADDR_TYPE_PUBLIC;
    scan_report_.rssi = rssiDbm;
    fillReportType(pduHeader, &scan_report_.type);

    scan_report_len_ = static_cast<uint8_t>(payloadLength - 6U);
    if (scan_report_len_ > sizeof(scan_report_data_)) {
      scan_report_len_ = sizeof(scan_report_data_);
    }
    if (scan_report_len_ > 0U) {
      memcpy(scan_report_data_, &payload[6], scan_report_len_);
    }
    scan_report_.data.p_data = scan_report_data_;
    scan_report_.data.len = scan_report_len_;
    return true;
  }

  bool currentReportMatchesFilters() const {
    if (Bluefruit.Scanner.has_filter_rssi_ &&
        scan_report_.rssi < Bluefruit.Scanner.filter_rssi_dbm_) {
      return false;
    }
    if (Bluefruit.Scanner.has_filter_uuid_ &&
        !adDataHasUuid(scan_report_.data.p_data, scan_report_.data.len,
                       Bluefruit.Scanner.filter_uuid_)) {
      return false;
    }
    if (Bluefruit.Scanner.has_filter_msd_ &&
        !adDataHasMsdCompany(scan_report_.data.p_data, scan_report_.data.len,
                             Bluefruit.Scanner.filter_msd_company_)) {
      return false;
    }
    return true;
  }

  bool dispatchCurrentScanReport() {
    if (!currentReportMatchesFilters()) {
      return false;
    }

    Bluefruit.Scanner.paused_ = true;
    invokeBluefruitUserCallback(Bluefruit.Scanner.rx_callback_, &scan_report_);
    if (pending_connect_valid_) {
      (void)maybeConnectCentral();
    }
    return true;
  }

  bool maybeConnectCentral() {
    if (!pending_connect_valid_) {
      return false;
    }
    const unsigned long now = millis();
    if ((now - last_connect_attempt_ms_) < 250UL) {
      return false;
    }
    last_connect_attempt_ms_ = now;
    uint16_t interval_units = Bluefruit.central_conn_interval_;
    if (interval_units < 6U) {
      interval_units = 6U;
    } else if (interval_units > 3200U) {
      interval_units = 3200U;
    }
    uint16_t supervision_timeout_units = Bluefruit.central_supervision_timeout_;
    if (supervision_timeout_units < 10U) {
      supervision_timeout_units = 10U;
    } else if (supervision_timeout_units > 3200U) {
      supervision_timeout_units = 3200U;
    }
    if (!radio_.initiateConnection(pending_connect_address_, pending_connect_random_ != 0U,
                                   interval_units, supervision_timeout_units, 9U,
                                   1200000UL)) {
      return false;
    }
    pending_connect_valid_ = false;
    return true;
  }

  void maybeScanOrConnect() {
    if (pending_connect_valid_) {
      (void)maybeConnectCentral();
      return;
    }
    if (!Bluefruit.Scanner.running_ || Bluefruit.Scanner.paused_ ||
        Bluefruit.Scanner.rx_callback_ == nullptr) {
      return;
    }

    bool gotReport = false;
    if (Bluefruit.Scanner.active_scan_) {
      xiao_nrf54l15::BleActiveScanResult result{};
      if (radio_.scanActiveCycle(&result, 300000UL, 200000UL)) {
        if (buildScanReport(result, false)) {
          gotReport = true;
          (void)dispatchCurrentScanReport();
        }
        if (!pending_connect_valid_ && Bluefruit.Scanner.running_ &&
            Bluefruit.Scanner.rx_callback_ != nullptr &&
            buildScanReport(result, true)) {
          gotReport = true;
          (void)dispatchCurrentScanReport();
        }
      }
      return;
    } else {
      xiao_nrf54l15::BleScanPacket packet{};
      if (radio_.scanCycle(&packet, 300000UL)) {
        gotReport = buildScanReport(packet);
      }
    }
    if (!gotReport) {
      return;
    }
    (void)dispatchCurrentScanReport();
  }

  void maybeApplyCentralLinkConfig() {
    if (!radio_.isConnected() || radio_.connectionRole() != BleConnectionRole::kCentral) {
      return;
    }
    if (centralSyncProcedureActive()) {
      return;
    }
    if (static_cast<int32_t>(millis() - central_link_config_not_before_ms_) < 0) {
      return;
    }

    if (central_data_length_request_pending_) {
      if ((radio_.currentDataLength() >=
           static_cast<uint16_t>(BleRadio::kCustomGattMaxValueLength + 7U)) ||
          radio_.requestDataLengthUpdate()) {
        central_data_length_request_pending_ = false;
      }
    }

    if (central_mtu_request_pending_) {
      const uint16_t mtu = Bluefruit.central_requested_mtu_;
      if ((mtu <= 23U) || (radio_.currentAttMtu() >= mtu) ||
          radio_.requestAttMtuExchange(mtu)) {
        central_mtu_request_pending_ = false;
      }
    }
  }

  void maybeApplyDeferredConnectionRequests() {
    if (!radio_.isConnected() || centralSyncProcedureActive()) {
      return;
    }

    const unsigned long now = millis();

    if (deferred_connection_phy_request_pending_) {
      const uint8_t phy = deferred_connection_requested_phy_;
      const uint8_t currentPhy = radio_.getPHY();
      if (currentPhy == phy) {
        deferred_connection_phy_request_pending_ = false;
        deferred_connection_requested_phy_ = BLE_GAP_PHY_AUTO;
        deferred_connection_phy_attempts_ = 0U;
        deferred_connection_phy_next_ms_ = 0UL;
      } else if (deferred_connection_phy_attempts_ >=
                 kDeferredLinkRequestMaxAttempts) {
        deferred_connection_phy_request_pending_ = false;
        deferred_connection_requested_phy_ = BLE_GAP_PHY_AUTO;
        deferred_connection_phy_attempts_ = 0U;
        deferred_connection_phy_next_ms_ = 0UL;
      } else if (static_cast<int32_t>(now - deferred_connection_phy_next_ms_) >= 0) {
        (void)radio_.requestPHY(phy);
        ++deferred_connection_phy_attempts_;
        deferred_connection_phy_next_ms_ = now + kDeferredLinkRequestRetryMs;
      }
    }

    if (deferred_connection_data_length_request_pending_) {
      const uint16_t dataLength = radio_.currentDataLength();
      if (dataLength >= kDeferredDataLengthTarget ||
          dataLength > kDefaultDataLength) {
        deferred_connection_data_length_request_pending_ = false;
        deferred_connection_data_length_attempts_ = 0U;
        deferred_connection_data_length_next_ms_ = 0UL;
      } else if (deferred_connection_data_length_attempts_ >=
                 kDeferredLinkRequestMaxAttempts) {
        deferred_connection_data_length_request_pending_ = false;
        deferred_connection_data_length_attempts_ = 0U;
        deferred_connection_data_length_next_ms_ = 0UL;
      } else if (static_cast<int32_t>(
                     now - deferred_connection_data_length_next_ms_) >= 0) {
        (void)radio_.requestDataLengthUpdate();
        ++deferred_connection_data_length_attempts_;
        deferred_connection_data_length_next_ms_ =
            now + kDeferredLinkRequestRetryMs;
      }
    }

    if (deferred_connection_mtu_request_pending_) {
      const uint16_t mtu = deferred_connection_requested_mtu_;
      const uint16_t currentMtu = radio_.currentAttMtu();
      if ((mtu <= kDefaultAttMtu) || (currentMtu >= mtu) ||
          (currentMtu > kDefaultAttMtu)) {
        deferred_connection_mtu_request_pending_ = false;
        deferred_connection_requested_mtu_ = kDefaultAttMtu;
        deferred_connection_mtu_attempts_ = 0U;
        deferred_connection_mtu_next_ms_ = 0UL;
      } else if (deferred_connection_mtu_attempts_ >=
                 kDeferredLinkRequestMaxAttempts) {
        deferred_connection_mtu_request_pending_ = false;
        deferred_connection_requested_mtu_ = kDefaultAttMtu;
        deferred_connection_mtu_attempts_ = 0U;
        deferred_connection_mtu_next_ms_ = 0UL;
      } else if (static_cast<int32_t>(now - deferred_connection_mtu_next_ms_) >= 0) {
        (void)radio_.requestAttMtuExchange(mtu);
        ++deferred_connection_mtu_attempts_;
        deferred_connection_mtu_next_ms_ = now + kDeferredLinkRequestRetryMs;
      }
    }
  }

