lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Bluefruit52Lib/src/bluefruit.cpp
    if (attOpcode == responseOpcode) {
      result.outcome = AttWaitOutcome::kResponse;
      result.event = event;
      return result;
    }

    manager().handleCentralConnectionEvent(event);
  }

  return result;
}

bool queueServiceDiscoveryRequest(const BLEUuid& uuid, bool reverse128 = false) {
  if (uuid.size() == 2U) {
    uint8_t request[9] = {kAttOpFindByTypeValueReq, 0U, 0U, 0U, 0U, 0U, 0U, 0U, 0U};
    writeLe16(&request[1], 0x0001U);
    writeLe16(&request[3], 0xFFFFU);
    writeLe16(&request[5], kUuidPrimaryService);
    writeLe16(&request[7], uuid.uuid16());
    return queueCentralAttProcedure(
        [&]() { return manager().radio().queueAttRequest(request, sizeof(request)); });
  }
  if (uuid.size() == 16U) {
    uint8_t request[23] = {0};
    request[0] = kAttOpFindByTypeValueReq;
    writeLe16(&request[1], 0x0001U);
    writeLe16(&request[3], 0xFFFFU);
    writeLe16(&request[5], kUuidPrimaryService);
    for (uint8_t i = 0U; i < 16U; ++i) {
      request[7U + i] = reverse128 ? uuid.uuid128()[15U - i] : uuid.uuid128()[i];
    }
    return queueCentralAttProcedure(
        [&]() { return manager().radio().queueAttRequest(request, sizeof(request)); });
  }
  return false;
}

bool discoverServiceRangeSync(const BLEUuid& uuid, uint16_t* startHandle,
                              uint16_t* endHandle) {
  ScopedCentralSyncProcedure scopedProcedure;
  if (startHandle == nullptr || endHandle == nullptr) {
    return false;
  }
  if (!queueServiceDiscoveryRequest(uuid, false)) {
    return false;
  }

  const AttWaitResult wait =
      waitForAttOpcode(kAttOpFindByTypeValueReq, kAttOpFindByTypeValueRsp);
  if (wait.outcome != AttWaitOutcome::kResponse || wait.event.payloadLength < 9U) {
    if (uuid.size() != 16U) {
      return false;
    }
  } else {
    *startHandle = readLe16(&wait.event.payload[5]);
    *endHandle = readLe16(&wait.event.payload[7]);
    if ((*startHandle != 0U) && (*endHandle >= *startHandle)) {
      return true;
    }
  }

  if (uuid.size() == 16U) {
    if (!queueServiceDiscoveryRequest(uuid, true)) {
      return false;
    }

    const AttWaitResult reversedWait =
        waitForAttOpcode(kAttOpFindByTypeValueReq, kAttOpFindByTypeValueRsp);
    if (reversedWait.outcome == AttWaitOutcome::kResponse &&
        reversedWait.event.payloadLength >= 9U) {
      *startHandle = readLe16(&reversedWait.event.payload[5]);
      *endHandle = readLe16(&reversedWait.event.payload[7]);
      if ((*startHandle != 0U) && (*endHandle >= *startHandle)) {
        return true;
      }
    }
  } else {
    return false;
  }

  uint16_t searchStart = 0x0001U;
  while (searchStart <= 0xFFFFU) {
    uint8_t request[7] = {kAttOpReadByGroupTypeReq, 0U, 0U, 0U, 0U, 0U, 0U};
    writeLe16(&request[1], searchStart);
    writeLe16(&request[3], 0xFFFFU);
    writeLe16(&request[5], kUuidPrimaryService);
    if (!queueCentralAttProcedure(
            [&]() { return manager().radio().queueAttRequest(request, sizeof(request)); })) {
      return false;
    }

    const AttWaitResult groupWait =
        waitForAttOpcode(kAttOpReadByGroupTypeReq, kAttOpReadByGroupTypeRsp);
    if (groupWait.outcome == AttWaitOutcome::kError &&
        groupWait.errorCode == kAttErrAttributeNotFound) {
      return false;
    }
    if (groupWait.outcome != AttWaitOutcome::kResponse || groupWait.event.payloadLength < 10U) {
      return false;
    }

    const uint8_t entryLen = groupWait.event.payload[5];
    if (entryLen < 6U) {
      return false;
    }

    uint16_t lastEndHandle = searchStart;
    for (uint8_t offset = 6U;
         (offset + static_cast<uint8_t>(entryLen - 1U)) < groupWait.event.payloadLength;
         offset = static_cast<uint8_t>(offset + entryLen)) {
      const uint16_t candidateStart = readLe16(&groupWait.event.payload[offset]);
      const uint16_t candidateEnd = readLe16(&groupWait.event.payload[offset + 2U]);
      const uint8_t uuidLen = static_cast<uint8_t>(entryLen - 4U);
      const uint8_t* candidateUuid = &groupWait.event.payload[offset + 4U];
      lastEndHandle = candidateEnd;
      if (uuidMatches(uuid, candidateUuid, uuidLen)) {
        *startHandle = candidateStart;
        *endHandle = candidateEnd;
        return (*startHandle != 0U) && (*endHandle >= *startHandle);
      }
    }

    if (lastEndHandle == 0xFFFFU || lastEndHandle < searchStart) {
      break;
    }
    searchStart = static_cast<uint16_t>(lastEndHandle + 1U);
  }

  return false;
}

bool discoverCharacteristicSync(uint16_t serviceStartHandle, uint16_t serviceEndHandle,
                                const BLEUuid& uuid, uint16_t* declHandle,
                                uint16_t* valueHandle, uint16_t* endHandle) {
  ScopedCentralSyncProcedure scopedProcedure;
  if (declHandle == nullptr || valueHandle == nullptr || endHandle == nullptr ||
      serviceStartHandle == 0U || serviceEndHandle == 0U) {
    return false;
  }

  bool found = false;
  uint16_t searchStart = serviceStartHandle;
  *declHandle = 0U;
  *valueHandle = 0U;
  *endHandle = 0U;

  while (searchStart <= serviceEndHandle) {
    uint8_t request[7] = {kAttOpReadByTypeReq, 0U, 0U, 0U, 0U, 0U, 0U};
    writeLe16(&request[1], searchStart);
    writeLe16(&request[3], serviceEndHandle);
    writeLe16(&request[5], kUuidCharacteristic);
    if (!queueCentralAttProcedure(
            [&]() { return manager().radio().queueAttRequest(request, sizeof(request)); })) {
      return false;
    }

    const AttWaitResult wait =
        waitForAttOpcode(kAttOpReadByTypeReq, kAttOpReadByTypeRsp);
    if (wait.outcome == AttWaitOutcome::kError &&
        wait.errorCode == kAttErrAttributeNotFound) {
      break;
    }
    if (wait.outcome != AttWaitOutcome::kResponse || wait.event.payloadLength < 7U) {
      return false;
    }

    const uint8_t entryLen = wait.event.payload[5];
    if (entryLen < 7U) {
      return false;
    }

    uint16_t lastDecl = searchStart;
    bool anyEntry = false;
    for (uint8_t offset = 6U;
         (offset + static_cast<uint8_t>(entryLen - 1U)) < wait.event.payloadLength;
         offset = static_cast<uint8_t>(offset + entryLen)) {
      anyEntry = true;
      const uint16_t candidateDecl = readLe16(&wait.event.payload[offset]);
      const uint16_t candidateValue = readLe16(&wait.event.payload[offset + 3U]);
      const uint8_t uuidLen = static_cast<uint8_t>(entryLen - 5U);
      const uint8_t* candidateUuid = &wait.event.payload[offset + 5U];

      if (found && candidateDecl > *declHandle) {
        *endHandle = static_cast<uint16_t>(candidateDecl - 1U);
        return true;
      }

      if (!found && uuidMatches(uuid, candidateUuid, uuidLen)) {
        found = true;
        *declHandle = candidateDecl;
        *valueHandle = candidateValue;
        *endHandle = serviceEndHandle;
      }

      lastDecl = candidateDecl;
    }

    if (found) {
      return true;
    }

