lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Bluefruit52Lib/src/bluefruit.cpp
    if (!anyEntry || lastDecl >= serviceEndHandle) {
      break;
    }
    searchStart = static_cast<uint16_t>(lastDecl + 1U);
  }

  return found;
}

bool discoverCccdHandleSync(uint16_t valueHandle, uint16_t endHandle, uint16_t* cccdHandle) {
  ScopedCentralSyncProcedure scopedProcedure;
  if (cccdHandle == nullptr || valueHandle == 0U || endHandle <= valueHandle) {
    return false;
  }

  uint16_t searchStart = static_cast<uint16_t>(valueHandle + 1U);
  while (searchStart <= endHandle) {
    uint8_t request[5] = {kAttOpFindInfoReq, 0U, 0U, 0U, 0U};
    writeLe16(&request[1], searchStart);
    writeLe16(&request[3], endHandle);
    if (!queueCentralAttProcedure(
            [&]() { return manager().radio().queueAttRequest(request, sizeof(request)); })) {
      return false;
    }

    const AttWaitResult wait = waitForAttOpcode(kAttOpFindInfoReq, kAttOpFindInfoRsp);
    if (wait.outcome == AttWaitOutcome::kError &&
        wait.errorCode == kAttErrAttributeNotFound) {
      return false;
    }
    if (wait.outcome != AttWaitOutcome::kResponse || wait.event.payloadLength < 6U) {
      return false;
    }

    const uint8_t format = wait.event.payload[5];
    uint16_t lastHandle = searchStart;
    if (format == 0x01U) {
      for (uint8_t offset = 6U; (offset + 3U) < wait.event.payloadLength;
           offset = static_cast<uint8_t>(offset + 4U)) {
        const uint16_t handle = readLe16(&wait.event.payload[offset]);
        const uint16_t uuid16 = readLe16(&wait.event.payload[offset + 2U]);
        if (uuid16 == kUuidClientCharacteristicConfig) {
          *cccdHandle = handle;
          return true;
        }
        lastHandle = handle;
      }
    } else if (format == 0x02U) {
      for (uint8_t offset = 6U; (offset + 17U) < wait.event.payloadLength;
           offset = static_cast<uint8_t>(offset + 18U)) {
        lastHandle = readLe16(&wait.event.payload[offset]);
      }
    } else {
      return false;
    }

    if (lastHandle >= endHandle) {
      return false;
    }
    searchStart = static_cast<uint16_t>(lastHandle + 1U);
  }

  return false;
}

uint16_t readHandleSync(uint16_t handle, uint8_t* buffer, uint16_t bufferLen) {
  ScopedCentralSyncProcedure scopedProcedure;
  if (handle == 0U || buffer == nullptr || bufferLen == 0U ||
      !queueCentralAttProcedure(
          [&]() { return manager().radio().queueAttReadRequest(handle); })) {
    return 0U;
  }

  const AttWaitResult wait = waitForAttOpcode(kAttOpReadReq, kAttOpReadRsp);
  if (wait.outcome != AttWaitOutcome::kResponse || wait.event.payloadLength < 5U) {
    return 0U;
  }

  const uint16_t valueLen = static_cast<uint16_t>(wait.event.payloadLength - 5U);
  const uint16_t copyLen = min<uint16_t>(bufferLen, valueLen);
  if (copyLen > 0U) {
    memcpy(buffer, &wait.event.payload[5], copyLen);
  }
  return copyLen;
}

bool writeHandleSync(uint16_t handle, const uint8_t* data, uint8_t dataLen,
                     bool withResponse = true) {
  ScopedCentralSyncProcedure scopedProcedure;
  if (!queueCentralAttProcedure([&]() {
        return manager().radio().queueAttWriteRequest(handle, data, dataLen, withResponse);
      })) {
    return false;
  }
  if (!withResponse) {
    return true;
  }

  const AttWaitResult wait = waitForAttOpcode(kAttOpWriteReq, kAttOpWriteRsp);
  return wait.outcome == AttWaitOutcome::kResponse;
}

extern "C" void nrf54l15_bluefruit_compat_idle_service(void) {
  if (ScopedBluefruitUserCallback::active()) {
    return;
  }
  manager().idleService();
}

extern "C" uint32_t nrf54l15_bluefruit_compat_idle_sleep_cap_us(void) {
  return manager().idleSleepCapUs();
}

BLEUuid::BLEUuid() : size_(0U), uuid16_(0U), uuid128_{0} {}

BLEUuid::BLEUuid(uint16_t uuid16) : BLEUuid() { set(uuid16); }

BLEUuid::BLEUuid(const uint8_t uuid128[16]) : BLEUuid() { set(uuid128); }

BLEUuid::BLEUuid(const char* str) : BLEUuid() { set(str); }

void BLEUuid::set(uint16_t uuid16) {
  size_ = 2U;
  uuid16_ = uuid16;
  memset(uuid128_, 0, sizeof(uuid128_));
}

void BLEUuid::set(const uint8_t uuid128[16]) {
  if (uuid128 == nullptr) {
    size_ = 0U;
    uuid16_ = 0U;
    memset(uuid128_, 0, sizeof(uuid128_));
    return;
  }
  size_ = 16U;
  uuid16_ = 0U;
  memcpy(uuid128_, uuid128, sizeof(uuid128_));
}

void BLEUuid::set(const char* str) {
  uint8_t parsed[16] = {0};
  uint8_t parsedSize = 0U;
  uint16_t parsed16 = 0U;
  if (!parseUuidString(str, parsed, &parsedSize, &parsed16)) {
    size_ = 0U;
    uuid16_ = 0U;
    memset(uuid128_, 0, sizeof(uuid128_));
    return;
  }
  if (parsedSize == 2U) {
    set(parsed16);
  } else {
    set(parsed);
  }
}

bool BLEUuid::get(uint16_t* uuid16) const {
  if (uuid16 == nullptr || size_ != 2U) {
    return false;
  }
  *uuid16 = uuid16_;
  return true;
}

bool BLEUuid::get(uint8_t uuid128[16]) const {
  if (uuid128 == nullptr || size_ != 16U) {
    return false;
  }
  memcpy(uuid128, uuid128_, sizeof(uuid128_));
  return true;
}

size_t BLEUuid::size() const { return size_; }

bool BLEUuid::begin() const { return size_ == 2U || size_ == 16U; }

String BLEUuid::toString() const {
  if (size_ == 2U) {
    char buffer[5] = {0};
    snprintf(buffer, sizeof(buffer), "%04X", uuid16_);
    return String(buffer);
  }
  if (size_ != 16U) {
    return String();
  }
  uint8_t bigEndian[16] = {0};
  for (size_t i = 0U; i < 16U; ++i) {
    bigEndian[i] = uuid128_[15U - i];
  }
  char buffer[37] = {0};
  snprintf(buffer, sizeof(buffer),
           "%02X%02X%02X%02X-%02X%02X-%02X%02X-%02X%02X-%02X%02X%02X%02X%02X%02X",
           bigEndian[0], bigEndian[1], bigEndian[2], bigEndian[3], bigEndian[4],
           bigEndian[5], bigEndian[6], bigEndian[7], bigEndian[8], bigEndian[9],
           bigEndian[10], bigEndian[11], bigEndian[12], bigEndian[13], bigEndian[14],
           bigEndian[15]);
  return String(buffer);
}

bool BLEUuid::operator==(const BLEUuid& rhs) const {
  if (size_ != rhs.size_) {
    return false;
  }
  if (size_ == 2U) {
    return uuid16_ == rhs.uuid16_;
  }
  if (size_ == 16U) {
    return memcmp(uuid128_, rhs.uuid128_, sizeof(uuid128_)) == 0;
  }
  return true;
}

