lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Bluefruit52Lib/src/bluefruit.cpp
bool BLEUuid::operator!=(const BLEUuid& rhs) const { return !(*this == rhs); }

uint16_t BLEUuid::uuid16() const { return uuid16_; }

const uint8_t* BLEUuid::uuid128() const { return uuid128_; }

BLEService::BLEService()
    : uuid(), _handle(0U), _read_perm(SECMODE_OPEN), _write_perm(SECMODE_OPEN),
      _begun(false) {}

BLEService::BLEService(BLEUuid bleuuid)
    : uuid(bleuuid), _handle(0U), _read_perm(SECMODE_OPEN), _write_perm(SECMODE_OPEN),
      _begun(false) {}

void BLEService::setUuid(BLEUuid bleuuid) { uuid = bleuuid; }

void BLEService::setPermission(SecureMode_t read_perm, SecureMode_t write_perm) {
  _read_perm = read_perm;
  _write_perm = write_perm;
}

void BLEService::getPermission(SecureMode_t* read_perm, SecureMode_t* write_perm) const {
  if (read_perm != nullptr) {
    *read_perm = _read_perm;
  }
  if (write_perm != nullptr) {
    *write_perm = _write_perm;
  }
}

err_t BLEService::begin() {
  if (!manager().begin(1U, 0U)) {
    return ERROR_INVALID_STATE;
  }
  if (_begun) {
    lastService = this;
    return ERROR_NONE;
  }

  bool ok = false;
  if (uuid.size() == 2U) {
    ok = manager().radio().addCustomGattService(uuid.uuid16(), &_handle);
  } else if (uuid.size() == 16U) {
    ok = manager().radio().addCustomGattService128(uuid.uuid128(), &_handle);
  }
  if (!ok) {
    return ERROR_INVALID_STATE;
  }

  _begun = true;
  lastService = this;
  return ERROR_NONE;
}

BLECharacteristic::BLECharacteristic()
    : uuid(),
      _is_temp(false),
      _max_len(BleRadio::kCustomGattMaxValueLength),
      _fixed_len(false),
      _service(nullptr),
      _userbuf(nullptr),
      _userbufsize(0U),
      _properties(0U),
      _read_perm(SECMODE_OPEN),
      _write_perm(SECMODE_OPEN),
      _handles{0U, 0U, 0U, 0U},
      _value{0},
      _value_len(0U),
      _notify_enabled(false),
      _indicate_enabled(false),
      _usr_descriptor(nullptr),
      _wr_cb(nullptr),
      _cccd_wr_cb(nullptr),
      _rd_authorize_cb(nullptr),
      _wr_authorize_cb(nullptr) {}

BLECharacteristic::BLECharacteristic(BLEUuid bleuuid) : BLECharacteristic() { uuid = bleuuid; }

BLECharacteristic::BLECharacteristic(BLEUuid bleuuid, uint8_t properties)
    : BLECharacteristic(bleuuid) {
  _properties = properties;
}

BLECharacteristic::BLECharacteristic(BLEUuid bleuuid, uint8_t properties, int max_len,
                                     bool fixed_len)
    : BLECharacteristic(bleuuid, properties) {
  setMaxLen(static_cast<uint16_t>(max_len));
  if (fixed_len) {
    setFixedLen(static_cast<uint16_t>(max_len));
  }
}

BLEService& BLECharacteristic::parentService() { return *_service; }

void BLECharacteristic::setTempMemory() { _is_temp = true; }

void BLECharacteristic::setUuid(BLEUuid bleuuid) { uuid = bleuuid; }

void BLECharacteristic::setProperties(uint8_t prop) { _properties = prop; }

void BLECharacteristic::setPermission(SecureMode_t read_perm, SecureMode_t write_perm) {
  _read_perm = read_perm;
  _write_perm = write_perm;
}

void BLECharacteristic::setMaxLen(uint16_t max_len) {
  _max_len = (max_len > BleRadio::kCustomGattMaxValueLength)
                 ? BleRadio::kCustomGattMaxValueLength
                 : max_len;
}

void BLECharacteristic::setFixedLen(uint16_t fixed_len) {
  setMaxLen(fixed_len);
  _fixed_len = true;
}

void BLECharacteristic::setBuffer(void* buf, uint16_t bufsize) {
  _userbuf = static_cast<uint8_t*>(buf);
  _userbufsize = bufsize;
}

uint16_t BLECharacteristic::getMaxLen() const { return _max_len; }

bool BLECharacteristic::isFixedLen() const { return _fixed_len; }

void BLECharacteristic::setUserDescriptor(const char* descriptor) { _usr_descriptor = descriptor; }

void BLECharacteristic::setReportRefDescriptor(uint8_t id, uint8_t type) {
  (void)id;
  (void)type;
}

void BLECharacteristic::setPresentationFormatDescriptor(uint8_t type, int8_t exponent,
                                                        uint16_t unit, uint8_t name_space,
                                                        uint16_t descriptor) {
  (void)type;
  (void)exponent;
  (void)unit;
  (void)name_space;
  (void)descriptor;
}

void BLECharacteristic::setWriteCallback(write_cb_t fp, bool useAdaCallback) {
  (void)useAdaCallback;
  _wr_cb = fp;
}

void BLECharacteristic::setCccdWriteCallback(write_cccd_cb_t fp, bool useAdaCallback) {
  (void)useAdaCallback;
  _cccd_wr_cb = fp;
}

void BLECharacteristic::setReadAuthorizeCallback(read_authorize_cb_t fp, bool useAdaCallback) {
  (void)useAdaCallback;
  _rd_authorize_cb = fp;
}

void BLECharacteristic::setWriteAuthorizeCallback(write_authorize_cb_t fp,
                                                  bool useAdaCallback) {
  (void)useAdaCallback;
  _wr_authorize_cb = fp;
}

err_t BLECharacteristic::begin() {
  if (!manager().begin(1U, 0U)) {
    return ERROR_INVALID_STATE;
  }
  if (_handles.value_handle != 0U) {
    return ERROR_NONE;
  }

  _service = BLEService::lastService;
  if (_service == nullptr || !_service->_begun) {
    return ERROR_INVALID_STATE;
  }

  uint16_t valueHandle = 0U;
  uint16_t cccdHandle = 0U;
  const uint8_t initialLen = clampValueLen(_value_len);
  const uint8_t properties = mapProperties(_properties);
  bool ok = false;
  if (uuid.size() == 2U) {
    ok = manager().radio().addCustomGattCharacteristic(
        _service->_handle, uuid.uuid16(), properties, _value, initialLen, &valueHandle,
        &cccdHandle);
  } else if (uuid.size() == 16U) {
    ok = manager().radio().addCustomGattCharacteristic128(
        _service->_handle, uuid.uuid128(), properties, _value, initialLen, &valueHandle,
        &cccdHandle);
  }
  if (!ok) {
    return ERROR_INVALID_STATE;
  }

  _handles.value_handle = valueHandle;
  _handles.decl_handle = (valueHandle > 0U) ? static_cast<uint16_t>(valueHandle - 1U) : 0U;
  _handles.cccd_handle = cccdHandle;
  if (!manager().registerCharacteristic(this)) {
    return ERROR_NO_MEM;
  }
  return ERROR_NONE;
}

ble_gatts_char_handles_t BLECharacteristic::handles() const { return _handles; }

uint16_t BLECharacteristic::write(const void* data, uint16_t len) {
  if (data == nullptr && len > 0U) {
    return 0U;
  }
  const uint8_t toWrite = clampValueLen((_fixed_len && _max_len > 0U) ? _max_len : len);
  memset(_value, 0, sizeof(_value));
  if (data != nullptr && toWrite > 0U) {
    memcpy(_value, data, min<uint8_t>(toWrite, clampValueLen(len)));
  }
  _value_len = toWrite;
  if (_userbuf != nullptr && _userbufsize > 0U) {
    const uint16_t copied = min<uint16_t>(_userbufsize, _value_len);
    memcpy(_userbuf, _value, copied);
  }
  if (_handles.value_handle != 0U) {
    manager().radio().setCustomGattCharacteristicValue(_handles.value_handle, _value, _value_len);
  }
  return _value_len;
}

uint16_t BLECharacteristic::write(const char* str) {
  return write(str, (str != nullptr) ? static_cast<uint16_t>(strlen(str)) : 0U);
}

uint16_t BLECharacteristic::write8(uint8_t num) { return write(&num, sizeof(num)); }

uint16_t BLECharacteristic::write16(uint16_t num) { return write(&num, sizeof(num)); }

uint16_t BLECharacteristic::write32(uint32_t num) { return write(&num, sizeof(num)); }

uint16_t BLECharacteristic::write32(int num) { return write(&num, sizeof(num)); }

