lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Bluefruit52Lib/src/bluefruit.cpp
void BLEBeacon::setManufacturer(uint16_t manufacturer) { manufacturer_ = manufacturer; }

void BLEBeacon::setUuid(const uint8_t uuid128[16]) {
  if (uuid128 == nullptr) {
    memset(uuid128_, 0, sizeof(uuid128_));
    uuid_valid_ = false;
    return;
  }
  memcpy(uuid128_, uuid128, sizeof(uuid128_));
  uuid_valid_ = true;
}

void BLEBeacon::setMajorMinor(uint16_t major, uint16_t minor) {
  major_be_ = byteSwap16(major);
  minor_be_ = byteSwap16(minor);
}

void BLEBeacon::setRssiAt1m(int8_t rssi) { rssi_at_1m_ = rssi; }

bool BLEBeacon::start() { return start(Bluefruit.Advertising); }

bool BLEBeacon::start(BLEAdvertising& adv) {
  if (!uuid_valid_) {
    return false;
  }

  struct {
    uint16_t manufacturer;
    uint8_t beacon_type;
    uint8_t beacon_len;
    uint8_t uuid128[16];
    uint16_t major;
    uint16_t minor;
    int8_t rssi_at_1m;
  } payload{};

  payload.manufacturer = manufacturer_;
  payload.beacon_type = 0x02U;
  payload.beacon_len = 21U;
  memcpy(payload.uuid128, uuid128_, sizeof(payload.uuid128));
  payload.major = major_be_;
  payload.minor = minor_be_;
  payload.rssi_at_1m = rssi_at_1m_;

  adv.clearData();
  return adv.addFlags(BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE) &&
         adv.addData(BLE_GAP_AD_TYPE_MANUFACTURER_SPECIFIC_DATA, &payload,
                     sizeof(payload));
}

namespace {

constexpr const char* kEddystonePrefixes[] = {
    "http://www.",
    "https://www.",
    "http://",
    "https://",
};

constexpr const char* kEddystoneExpansions[] = {
    ".com/",
    ".org/",
    ".edu/",
    ".net/",
    ".info/",
    ".biz/",
    ".gov/",
    ".com",
    ".org",
    ".edu",
    ".net",
    ".info",
    ".biz",
    ".gov",
};

const char* findEddystoneExpansion(const char* url, uint8_t* index) {
  if (url == nullptr || index == nullptr) {
    return nullptr;
  }
  for (uint8_t i = 0U; i < (sizeof(kEddystoneExpansions) / sizeof(kEddystoneExpansions[0]));
       ++i) {
    const char* match = strstr(url, kEddystoneExpansions[i]);
    if (match != nullptr) {
      *index = i;
      return match;
    }
  }
  return nullptr;
}

}  // namespace

EddyStoneUrl::EddyStoneUrl() : rssi_(0), url_(nullptr) {}

EddyStoneUrl::EddyStoneUrl(int8_t rssiAt0m, const char* url) : rssi_(rssiAt0m), url_(url) {}

void EddyStoneUrl::setUrl(const char* url) { url_ = url; }

void EddyStoneUrl::setRssi(int8_t rssiAt0m) { rssi_ = rssiAt0m; }

bool EddyStoneUrl::start() { return start(Bluefruit.Advertising); }

bool EddyStoneUrl::start(BLEAdvertising& adv) {
  if (url_ == nullptr) {
    return false;
  }

  struct ATTR_PACKED {
    uint16_t eddystone_uuid;
    uint8_t frame_type;
    int8_t rssi_at_0m;
    uint8_t url_scheme;
    uint8_t encoded_url[17];
  } payload{};

  payload.eddystone_uuid = UUID16_SVC_EDDYSTONE;
  payload.frame_type = 0x10U;
  payload.rssi_at_0m = rssi_;
  payload.url_scheme = 0xFFU;

  const char* url = url_;
  for (uint8_t i = 0U; i < (sizeof(kEddystonePrefixes) / sizeof(kEddystonePrefixes[0])); ++i) {
    const size_t prefixLen = strlen(kEddystonePrefixes[i]);
    if (strncmp(url, kEddystonePrefixes[i], prefixLen) == 0) {
      payload.url_scheme = i;
      url += prefixLen;
      break;
    }
  }
  if (payload.url_scheme == 0xFFU) {
    return false;
  }

  uint8_t encodedLen = 0U;
  while (*url != '\0') {
    uint8_t expansionCode = 0U;
    const char* expansion = findEddystoneExpansion(url, &expansionCode);
    const size_t copyLen =
        (expansion != nullptr) ? static_cast<size_t>(expansion - url) : strlen(url);
    if ((encodedLen + copyLen + ((expansion != nullptr) ? 1U : 0U)) >
        sizeof(payload.encoded_url)) {
      return false;
    }

    memcpy(&payload.encoded_url[encodedLen], url, copyLen);
    encodedLen = static_cast<uint8_t>(encodedLen + copyLen);
    url += copyLen;

    if (expansion != nullptr) {
      payload.encoded_url[encodedLen++] = expansionCode;
      url += strlen(kEddystoneExpansions[expansionCode]);
    }
  }

  adv.clearData();
  return adv.addFlags(BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE) &&
         adv.addUuid(UUID16_SVC_EDDYSTONE) &&
         adv.addData(BLE_GAP_AD_TYPE_SERVICE_DATA, &payload,
                     static_cast<uint8_t>(5U + encodedLen));
}

BLEPeriph::BLEPeriph()
    : connect_callback_(nullptr),
      disconnect_callback_(nullptr),
      conn_interval_min_(BLE_GAP_CONN_MIN_INTERVAL_DFLT),
      conn_interval_max_(BLE_GAP_CONN_MAX_INTERVAL_DFLT),
      conn_latency_(BLE_GAP_CONN_SLAVE_LATENCY),
      conn_supervision_timeout_(BLE_GAP_CONN_SUPERVISION_TIMEOUT_MS / 10U) {}

void BLEPeriph::setConnectCallback(ble_connect_callback_t fp) { connect_callback_ = fp; }

void BLEPeriph::setDisconnectCallback(ble_disconnect_callback_t fp) {
  disconnect_callback_ = fp;
}

bool BLEPeriph::setConnInterval(uint16_t min_interval, uint16_t max_interval) {
  conn_interval_min_ = min_interval;
  conn_interval_max_ = (max_interval == 0U) ? min_interval : max_interval;
  manager().radio().setPreferredConnectionParameters(conn_interval_min_, conn_interval_max_,
                                                     conn_latency_,
                                                     conn_supervision_timeout_);
  return true;
}

bool BLEPeriph::setConnIntervalMS(uint16_t min_ms, uint16_t max_ms) {
  return setConnInterval(MS100TO125(min_ms), MS100TO125(max_ms));
}

bool BLEPeriph::setConnSlaveLatency(uint16_t latency) {
  conn_latency_ = latency;
  manager().radio().setPreferredConnectionParameters(conn_interval_min_, conn_interval_max_,
                                                     conn_latency_,
                                                     conn_supervision_timeout_);
  return true;
}

bool BLEPeriph::setConnSupervisionTimeout(uint16_t timeout) {
  conn_supervision_timeout_ = timeout;
  manager().radio().setPreferredConnectionParameters(conn_interval_min_, conn_interval_max_,
                                                     conn_latency_,
                                                     conn_supervision_timeout_);
  return true;
}

bool BLEPeriph::setConnSupervisionTimeoutMS(uint16_t timeout_ms) {
  return setConnSupervisionTimeout(timeout_ms / 10U);
}

