lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Bluefruit52Lib/src/bluefruit.cpp
BLEAncs::BLEAncs()
    : BLEClientService(kAncsServiceUuid),
      control_(kAncsControlUuid),
      notification_(kAncsNotificationUuid),
      data_(kAncsDataUuid),
      notification_callback_(nullptr) {}

bool BLEAncs::begin() {
  notification_.setNotifyCallback(notificationThunk);
  data_.setNotifyCallback(dataThunk);
  return BLEClientService::begin() && control_.begin(this) && notification_.begin(this) &&
         data_.begin(this);
}

bool BLEAncs::discover(uint16_t conn_handle) {
  if (!begin() || !BLEClientService::discover(conn_handle)) {
    return false;
  }
  const bool foundControl = control_.discover();
  const bool foundNotification = notification_.discover();
  const bool foundData = data_.discover();
  return foundControl && foundNotification && foundData;
}

void BLEAncs::setNotificationCallback(notification_callback_t fp) {
  notification_callback_ = fp;
}

bool BLEAncs::enableNotification() {
  return data_.enableNotify() && notification_.enableNotify();
}

bool BLEAncs::disableNotification() {
  bool ok = true;
  if (notification_.discovered()) {
    ok = notification_.disableNotify() && ok;
  }
  if (data_.discovered()) {
    ok = data_.disableNotify() && ok;
  }
  return ok;
}

uint16_t BLEAncs::getAttribute(uint32_t uid, uint8_t attr, void* buffer, uint16_t bufsize) {
  (void)uid;
  (void)attr;
  if (buffer != nullptr && bufsize > 0U) {
    memset(buffer, 0, bufsize);
  }
  return 0U;
}

uint16_t BLEAncs::getAppAttribute(const char* appid, uint8_t attr, void* buffer,
                                  uint16_t bufsize) {
  (void)appid;
  (void)attr;
  if (buffer != nullptr && bufsize > 0U) {
    memset(buffer, 0, bufsize);
  }
  return 0U;
}

bool BLEAncs::performAction(uint32_t uid, uint8_t actionid) {
  if (!control_.discovered()) {
    return false;
  }
  uint8_t payload[6] = {ANCS_CMD_PERFORM_NOTIFICATION_ACTION, 0U, 0U, 0U, 0U, actionid};
  memcpy(&payload[1], &uid, sizeof(uid));
  return control_.write(payload, sizeof(payload)) == sizeof(payload);
}

uint16_t BLEAncs::getAppName(uint32_t uid, void* buffer, uint16_t bufsize) {
  return getAppAttribute("", ANCS_APP_ATTR_DISPLAY_NAME, buffer, bufsize);
}

uint16_t BLEAncs::getAppID(uint32_t uid, void* buffer, uint16_t bufsize) {
  return getAttribute(uid, ANCS_ATTR_APP_IDENTIFIER, buffer, bufsize);
}

uint16_t BLEAncs::getTitle(uint32_t uid, void* buffer, uint16_t bufsize) {
  return getAttribute(uid, ANCS_ATTR_TITLE, buffer, bufsize);
}

uint16_t BLEAncs::getSubtitle(uint32_t uid, void* buffer, uint16_t bufsize) {
  return getAttribute(uid, ANCS_ATTR_SUBTITLE, buffer, bufsize);
}

uint16_t BLEAncs::getMessage(uint32_t uid, void* buffer, uint16_t bufsize) {
  return getAttribute(uid, ANCS_ATTR_MESSAGE, buffer, bufsize);
}

uint16_t BLEAncs::getMessageSize(uint32_t uid) {
  uint16_t value = 0U;
  (void)getAttribute(uid, ANCS_ATTR_MESSAGE_SIZE, &value, sizeof(value));
  return value;
}

uint16_t BLEAncs::getDate(uint32_t uid, void* buffer, uint16_t bufsize) {
  return getAttribute(uid, ANCS_ATTR_DATE, buffer, bufsize);
}

uint16_t BLEAncs::getPosActionLabel(uint32_t uid, void* buffer, uint16_t bufsize) {
  return getAttribute(uid, ANCS_ATTR_POSITIVE_ACTION_LABEL, buffer, bufsize);
}

uint16_t BLEAncs::getNegActionLabel(uint32_t uid, void* buffer, uint16_t bufsize) {
  return getAttribute(uid, ANCS_ATTR_NEGATIVE_ACTION_LABEL, buffer, bufsize);
}

bool BLEAncs::actPositive(uint32_t uid) { return performAction(uid, ANCS_ACTION_POSITIVE); }

bool BLEAncs::actNegative(uint32_t uid) { return performAction(uid, ANCS_ACTION_NEGATIVE); }

void BLEAncs::handleNotification(uint8_t* data, uint16_t len) {
  if (notification_callback_ == nullptr || data == nullptr || len < sizeof(AncsNotification_t)) {
    return;
  }
  invokeBluefruitUserCallback(notification_callback_,
                              reinterpret_cast<AncsNotification_t*>(data));
}

void BLEAncs::notificationThunk(BLEClientCharacteristic* chr, uint8_t* data, uint16_t len) {
  if (chr == nullptr) {
    return;
  }
  static_cast<BLEAncs&>(chr->parentService()).handleNotification(data, len);
}

void BLEAncs::dataThunk(BLEClientCharacteristic* chr, uint8_t* data, uint16_t len) {
  (void)chr;
  (void)data;
  (void)len;
}

BLEClientHidAdafruit::BLEClientHidAdafruit()
    : BLEClientService(UUID16_SVC_HUMAN_INTERFACE_DEVICE),
      keyboard_callback_(nullptr),
      mouse_callback_(nullptr),
      gamepad_callback_(nullptr),
      last_keyboard_report_{0},
      last_mouse_report_{0},
      last_gamepad_report_{0},
      protocol_mode_(UUID16_CHR_PROTOCOL_MODE),
      hid_info_(UUID16_CHR_HID_INFORMATION),
      hid_control_(UUID16_CHR_HID_CONTROL_POINT),
      keyboard_boot_input_(UUID16_CHR_BOOT_KEYBOARD_INPUT_REPORT),
      keyboard_boot_output_(UUID16_CHR_BOOT_KEYBOARD_OUTPUT_REPORT),
      mouse_boot_input_(UUID16_CHR_BOOT_MOUSE_INPUT_REPORT),
      gamepad_report_(UUID16_CHR_REPORT) {}

bool BLEClientHidAdafruit::begin() {
  keyboard_boot_input_.setNotifyCallback(keyboardNotifyThunk);
  mouse_boot_input_.setNotifyCallback(mouseNotifyThunk);
  gamepad_report_.setNotifyCallback(gamepadNotifyThunk);
  return BLEClientService::begin() && protocol_mode_.begin(this) && hid_info_.begin(this) &&
         hid_control_.begin(this) && keyboard_boot_input_.begin(this) &&
         keyboard_boot_output_.begin(this) && mouse_boot_input_.begin(this) &&
         gamepad_report_.begin(this);
}

bool BLEClientHidAdafruit::discover(uint16_t conn_handle) {
  if (!begin() || !BLEClientService::discover(conn_handle)) {
    return false;
  }
  (void)protocol_mode_.discover();
  (void)hid_info_.discover();
  (void)hid_control_.discover();
  (void)keyboard_boot_input_.discover();
  (void)keyboard_boot_output_.discover();
  (void)mouse_boot_input_.discover();
  (void)gamepad_report_.discover();
  return hid_info_.discovered() && hid_control_.discovered() &&
         (keyboardPresent() || mousePresent() || gamepadPresent());
}

bool BLEClientHidAdafruit::getHidInfo(uint8_t info[4]) {
  return (info != nullptr) && (hid_info_.read(info, 4U) == 4U);
}

