lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Bluefruit52Lib/src/bluefruit.cpp
uint8_t BLEClientHidAdafruit::getCountryCode(void) {
  uint8_t info[4] = {0};
  return getHidInfo(info) ? info[2] : 0U;
}

bool BLEClientHidAdafruit::setBootMode(bool boot) {
  return protocol_mode_.discovered() && protocol_mode_.write8(boot ? 0U : 1U) == 1U;
}

bool BLEClientHidAdafruit::keyboardPresent(void) {
  return keyboard_boot_input_.discovered() && keyboard_boot_output_.discovered() &&
         protocol_mode_.discovered();
}

bool BLEClientHidAdafruit::enableKeyboard(void) { return keyboard_boot_input_.enableNotify(); }

bool BLEClientHidAdafruit::disableKeyboard(void) { return keyboard_boot_input_.disableNotify(); }

void BLEClientHidAdafruit::getKeyboardReport(hid_keyboard_report_t* report) {
  if (report != nullptr) {
    memcpy(report, &last_keyboard_report_, sizeof(last_keyboard_report_));
  }
}

bool BLEClientHidAdafruit::mousePresent(void) {
  return mouse_boot_input_.discovered() && protocol_mode_.discovered();
}

bool BLEClientHidAdafruit::enableMouse(void) { return mouse_boot_input_.enableNotify(); }

bool BLEClientHidAdafruit::disableMouse(void) { return mouse_boot_input_.disableNotify(); }

void BLEClientHidAdafruit::getMouseReport(hid_mouse_report_t* report) {
  if (report != nullptr) {
    memcpy(report, &last_mouse_report_, sizeof(last_mouse_report_));
  }
}

bool BLEClientHidAdafruit::gamepadPresent(void) { return gamepad_report_.discovered(); }

bool BLEClientHidAdafruit::enableGamepad(void) { return gamepad_report_.enableNotify(); }

bool BLEClientHidAdafruit::disableGamepad(void) { return gamepad_report_.disableNotify(); }

void BLEClientHidAdafruit::getGamepadReport(hid_gamepad_report_t* report) {
  if (report != nullptr) {
    memcpy(report, &last_gamepad_report_, sizeof(last_gamepad_report_));
  }
}

void BLEClientHidAdafruit::setKeyboardReportCallback(kbd_callback_t fp) {
  keyboard_callback_ = fp;
}

void BLEClientHidAdafruit::setMouseReportCallback(mse_callback_t fp) {
  mouse_callback_ = fp;
}

void BLEClientHidAdafruit::setGamepadReportCallback(gpd_callback_t fp) {
  gamepad_callback_ = fp;
}

void BLEClientHidAdafruit::handleKeyboardInput(uint8_t* data, uint16_t len) {
  memset(&last_keyboard_report_, 0, sizeof(last_keyboard_report_));
  if (data != nullptr) {
    memcpy(&last_keyboard_report_, data, min<uint16_t>(len, sizeof(last_keyboard_report_)));
  }
  if (keyboard_callback_ != nullptr) {
    invokeBluefruitUserCallback(keyboard_callback_, &last_keyboard_report_);
  }
}

void BLEClientHidAdafruit::handleMouseInput(uint8_t* data, uint16_t len) {
  memset(&last_mouse_report_, 0, sizeof(last_mouse_report_));
  if (data != nullptr) {
    memcpy(&last_mouse_report_, data, min<uint16_t>(len, sizeof(last_mouse_report_)));
  }
  if (mouse_callback_ != nullptr) {
    invokeBluefruitUserCallback(mouse_callback_, &last_mouse_report_);
  }
}

void BLEClientHidAdafruit::handleGamepadInput(uint8_t* data, uint16_t len) {
  memset(&last_gamepad_report_, 0, sizeof(last_gamepad_report_));
  if (data != nullptr) {
    memcpy(&last_gamepad_report_, data, min<uint16_t>(len, sizeof(last_gamepad_report_)));
  }
  if (gamepad_callback_ != nullptr) {
    invokeBluefruitUserCallback(gamepad_callback_, &last_gamepad_report_);
  }
}

void BLEClientHidAdafruit::keyboardNotifyThunk(BLEClientCharacteristic* chr, uint8_t* data,
                                               uint16_t len) {
  if (chr != nullptr) {
    static_cast<BLEClientHidAdafruit&>(chr->parentService()).handleKeyboardInput(data, len);
  }
}

void BLEClientHidAdafruit::mouseNotifyThunk(BLEClientCharacteristic* chr, uint8_t* data,
                                            uint16_t len) {
  if (chr != nullptr) {
    static_cast<BLEClientHidAdafruit&>(chr->parentService()).handleMouseInput(data, len);
  }
}

void BLEClientHidAdafruit::gamepadNotifyThunk(BLEClientCharacteristic* chr, uint8_t* data,
                                              uint16_t len) {
  if (chr != nullptr) {
    static_cast<BLEClientHidAdafruit&>(chr->parentService()).handleGamepadInput(data, len);
  }
}

BLEHidAdafruit::BLEHidAdafruit()
    : BLEService(UUID16_SVC_HUMAN_INTERFACE_DEVICE),
      mouse_buttons_(0U),
      keyboard_led_callback_(nullptr) {}

err_t BLEHidAdafruit::begin() { return BLEService::begin(); }

void BLEHidAdafruit::setKeyboardLedCallback(kbd_led_cb_t fp) {
  keyboard_led_callback_ = fp;
}

bool BLEHidAdafruit::keyboardReport(hid_keyboard_report_t* report) {
  return keyboardReport(BLE_CONN_HANDLE_INVALID, report);
}

bool BLEHidAdafruit::keyboardReport(uint8_t modifier, uint8_t keycode[6]) {
  return keyboardReport(BLE_CONN_HANDLE_INVALID, modifier, keycode);
}

bool BLEHidAdafruit::keyPress(char ch) { return keyPress(BLE_CONN_HANDLE_INVALID, ch); }

bool BLEHidAdafruit::keyRelease(void) { return keyRelease(BLE_CONN_HANDLE_INVALID); }

bool BLEHidAdafruit::keySequence(const char* str, int interval) {
  return keySequence(BLE_CONN_HANDLE_INVALID, str, interval);
}

bool BLEHidAdafruit::keyboardReport(uint16_t conn_hdl, hid_keyboard_report_t* report) {
  (void)conn_hdl;
  return report != nullptr && Bluefruit.connected();
}

bool BLEHidAdafruit::keyboardReport(uint16_t conn_hdl, uint8_t modifier, uint8_t keycode[6]) {
  hid_keyboard_report_t report{};
  report.modifier = modifier;
  if (keycode != nullptr) {
    memcpy(report.keycode, keycode, sizeof(report.keycode));
  }
  return keyboardReport(conn_hdl, &report);
}

bool BLEHidAdafruit::keyPress(uint16_t conn_hdl, char ch) {
  const uint8_t ascii = static_cast<uint8_t>(ch);
  if (ascii >= 128U) {
    return false;
  }
  hid_keyboard_report_t report{};
  report.modifier = hid_ascii_to_keycode[ascii][0] ? KEYBOARD_MODIFIER_LEFTSHIFT : 0U;
  report.keycode[0] = hid_ascii_to_keycode[ascii][1];
  return keyboardReport(conn_hdl, &report);
}

bool BLEHidAdafruit::keyRelease(uint16_t conn_hdl) {
  hid_keyboard_report_t report{};
  return keyboardReport(conn_hdl, &report);
}

bool BLEHidAdafruit::keySequence(uint16_t conn_hdl, const char* str, int interval) {
  if (str == nullptr) {
    return false;
  }
  for (const char* cursor = str; *cursor != '\0'; ++cursor) {
    if (!keyPress(conn_hdl, *cursor)) {
      return false;
    }
    delay(interval);
    if (!keyRelease(conn_hdl)) {
      return false;
    }
    delay(interval);
  }
  return true;
}

bool BLEHidAdafruit::consumerReport(uint16_t usage_code) {
  return consumerReport(BLE_CONN_HANDLE_INVALID, usage_code);
}

bool BLEHidAdafruit::consumerKeyPress(uint16_t usage_code) {
  return consumerKeyPress(BLE_CONN_HANDLE_INVALID, usage_code);
}

bool BLEHidAdafruit::consumerKeyRelease(void) {
  return consumerKeyRelease(BLE_CONN_HANDLE_INVALID);
}

bool BLEHidAdafruit::consumerReport(uint16_t conn_hdl, uint16_t usage_code) {
  (void)conn_hdl;
  (void)usage_code;
  return Bluefruit.connected();
}

bool BLEHidAdafruit::consumerKeyPress(uint16_t conn_hdl, uint16_t usage_code) {
  return consumerReport(conn_hdl, usage_code);
}

bool BLEHidAdafruit::consumerKeyRelease(uint16_t conn_hdl) {
  return consumerReport(conn_hdl, 0U);
}

bool BLEHidAdafruit::mouseReport(hid_mouse_report_t* report) {
  return mouseReport(BLE_CONN_HANDLE_INVALID, report);
}

